#
# Copyright (C) 2022 DV Bern AG, Switzerland
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program.  If not, see <https://www.gnu.org/licenses/>.
#

# suppress inspection "UnusedProperty" for whole file

esc.validation.allowedLink=Le lien fourni n'est pas valide.
esc.validation.anlassConfigZeitraum=La date de l'\u00E9v\u00E9nement doit \u00EAtre dans la plage de temps de sa configuration
esc.validation.CheckUntersuchungAbschluss=Toutes les donn\u00E9es n'auront pas \u00E9t\u00E9 finalis\u00E9es.
esc.validation.checkUntersuchungArztBemerkungPresent=La remarque concernant l'examen m\u00E9dical doit \u00EAtre mentionn\u00E9e.
esc.validation.checkUntersuchungArztPresent=Les donn\u00E9es relatives \u00E0 l'examen m\u00E9dical doivent \u00EAtre d\u00E9finies.
esc.validation.CheckUntersuchungBewegungsapparat=Toutes les donn\u00E9es relatives \u00E0 appareil locomoteur n'ont pas \u00E9t\u00E9 collect\u00E9es.
esc.validation.checkUntersuchungDurchfuehrungPresent=Les donn\u00E9es de l'examen doivent \u00EAtre d\u00E9finies: veuillez s\u00E9lectionner le m\u00E9decin et l'assistant m\u00E9dical
esc.validation.checkUntersuchungGroesseGewichtPresent=Toutes les donn\u00E9es relatives \u00E0 la taille et au poids n'ont pas \u00E9t\u00E9 collect\u00E9es.
esc.validation.checkUntersuchungHoerenAudiogrammPresent=Toutes les donn\u00E9es relatives \u00E0 l'audiogramme n'ont pas \u00E9t\u00E9 recueillies.
esc.validation.checkUntersuchungHoerenOtoskopiePresent=Toutes les donn\u00E9es relatives \u00E0 l'otoscopie auditive n'ont pas \u00E9t\u00E9 recueillies.
esc.validation.checkUntersuchungImpfstatusKrankheitPresent=Les donn\u00E9es sur le statut vaccinal doivent \u00EAtre d\u00E9finies: veuillez saisir la date de la derni\u00E8re vaccination
esc.validation.checkUntersuchungImpfungenDataMinimalPresent=FR:Die Daten zu den Impfungen m\u00FCssen gesetzt sein.
esc.validation.checkUntersuchungImpfungenPresent=Les donn\u00E9es relatives aux vaccinations doivent \u00EAtre saisies.
esc.validation.CheckUntersuchungLaeusekontrolle=Les donn\u00E9es relatives au contr\u00F4le des poux doivent \u00EAtre d\u00E9finies.
esc.validation.checkUntersuchungSchulrelevanteBeeintraechtigungPresent=FR:Die Daten zu den Schhulrelevanten Beeintr\u00E4chtigungen m\u00FCssen gesetzt sein.
esc.validation.checkUntersuchungSehenBemerkungFragebogenPresent=La remarque du questionnaire de vision doit \u00EAtre renseign\u00E9e.
esc.validation.checkUntersuchungSehenBeurteilungPresent=Toutes les donn\u00E9es relatives \u00E0 la vision n'ont pas \u00E9t\u00E9 collect\u00E9es.
esc.validation.checkUntersuchungSprachePresent=FR:Die Daten zur Sprache m\u00FCssen gesetzt sein.
esc.validation.checkUntersuchungVorabklaerungen=FR:Die Vorabkl\u00E4rungen m\u00FCssen ausgef\u00FCllt werden.
esc.validation.daterange=De ne doit pas \u00EAtre post\u00E9rieur \u00E0 \u00E0
esc.validation.esadid=Veuillez saisir un num\u00E9ro esadId valide.
esc.validation.kindKlasseSchuleConsistency=La classe s\u00E9lectionn\u00E9e n'appartient pas \u00E0 l'\u00E9cole s\u00E9lectionn\u00E9e
esc.validation.einladungNotizUniqueness=Le type de note sp\u00E9cifi\u00E9 ne peut \u00EAtre cr\u00E9\u00E9 qu'une seule fois par invitation.
esc.validation.untersuchungImpfungIntern=Une vaccination effectu\u00E9e doit avoir les donn\u00E9es suivantes d\u00E9finies: lot de vaccin, date de la vaccination et personne effectuant la vaccination
esc.validation.anlassConfigImpfungKranheitUniqueness=Il ne faut pas s\u00E9lectionner une maladie des deux c\u00F4t\u00E9s.
esc.validation.documentQueueCsv=Pour les rapports individuels, une date de d\u00E9but et une date de fin doivent \u00EAtre sp\u00E9cifi\u00E9es.
